In [5]:
import pandas as pd

In [6]:
customers = pd.read_csv("C:/Users/Sol Joaquin/Documents/GitHub/Coffeeoffers/customers.csv")

In [7]:
events = pd.read_csv("C:\\Users\\Sol Joaquin\\Documents\\GitHub\\Coffeeoffers\\events.csv")
offers = pd.read_csv("C:\\Users\\Sol Joaquin\\Documents\\GitHub\\Coffeeoffers\\offers.csv")

In [8]:
customers.head()

                        customer_id  became_member_on gender  age    income
0  68be06ca386d4c31939f3a4f0e3dd783          20170212    NaN  118       NaN
1  0610b486422d4921ae7d2bf64640c50b          20170715      F   55  112000.0
2  38fe809add3b4fcf9315a9694bb96ff5          20180712    NaN  118       NaN
3  78afa995795e4d85b5d9ceeca43f5fef          20170509      F   75  100000.0
4  a03223e636434f42ac4c3df47e8bac43          20170804    NaN  118       NaN

In [11]:
import datetime as dt

In [13]:
#Convert became_member_on from string to date format into date column
customers['date'] = pd.to_datetime(customers['became_member_on'].astype(str),format = '%Y%m%d')
customers.head()

,customer_id,became_member_on,gender,age,income,date
0,68be06ca386d4c31939f3a4f0e3dd783,20170212,NaN,118,NaN,2017-02-12
1,0610b486422d4921ae7d2bf64640c50b,20170715,F,55,112000.0,2017-07-15
2,38fe809add3b4fcf9315a9694bb96ff5,20180712,NaN,118,NaN,2018-07-12
3,78afa995795e4d85b5d9ceeca43f5fef,20170509,F,75,100000.0,2017-05-09
4,a03223e636434f42ac4c3df47e8bac43,20170804,NaN,118,NaN,2017-08-04

In [15]:
customers['year'] = customers['date'].dt.year

In [16]:
customers.head()

,customer_id,became_member_on,gender,age,income,date,year
0,68be06ca386d4c31939f3a4f0e3dd783,20170212,NaN,118,NaN,2017-02-12,2017
1,0610b486422d4921ae7d2bf64640c50b,20170715,F,55,112000.0,2017-07-15,2017
2,38fe809add3b4fcf9315a9694bb96ff5,20180712,NaN,118,NaN,2018-07-12,2018
3,78afa995795e4d85b5d9ceeca43f5fef,20170509,F,75,100000.0,2017-05-09,2017
4,a03223e636434f42ac4c3df47e8bac43,20170804,NaN,118,NaN,2017-08-04,2017

In [17]:
customers.shape

(17000, 7)

In [18]:
events.shape

(306534, 4)

In [21]:
customers['month'] = customers['date'].dt.month
customers.describe

<bound method NDFrame.describe of                             customer_id  became_member_on gender  age  \
0      68be06ca386d4c31939f3a4f0e3dd783          20170212    NaN  118
1      0610b486422d4921ae7d2bf64640c50b          20170715      F   55
2      38fe809add3b4fcf9315a9694bb96ff5          20180712    NaN  118
3      78afa995795e4d85b5d9ceeca43f5fef          20170509      F   75
4      a03223e636434f42ac4c3df47e8bac43          20170804    NaN  118
...                                 ...               ...    ...  ...
16995  6d5f3a774f3d4714ab0c092238f3a1d7          20180604      F   45
16996  2cb4f97358b841b9a9773a7aa05a9d77          20180713      M   61
16997  01d26f638c274aa0b965d24cefe3183f          20170126      M   49
16998  9dc1421481194dcd9400aec7c9ae6366          20160307      F   83
16999  e4052622e5ba45a8b96b59aba68cf068          20170722      F   62

         income       date  year  month
0           NaN 2017-02-12  2017      2
1      112000.0 2017-07-15  2017      7
2           NaN 2018-07-12  2018      7
3      100000.0 2017-05-09  2017      5
4           NaN 2017-08-04  2017      8
...         ...        ...   ...    ...
16995   54000.0 2018-06-04  2018      6
16996   72000.0 2018-07-13  2018      7
16997   73000.0 2017-01-26  2017      1
16998   50000.0 2016-03-07  2016      3
16999   82000.0 2017-07-22  2017      7

[17000 rows x 8 columns]>

In [26]:
events_trial = events

In [23]:
events_trial.head()

,customer_id,event,value,time
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0

In [ ]:
#type(events_trial['value'][0])
# Not in dictionary keys
import ast
events_trial['value'] = events_trial['value'].apply(ast.literal_eval)

In [32]:
value_expanded = events_trial['value'].apply(pd.Series)
value_expanded

                                offer id  amount offer_id  reward
0       9b98b8c7a33c4b65b9aebfe6a799e6d9     NaN      NaN     NaN
1       0b1e1539f2cc45b7b9fa7c272da2e1d7     NaN      NaN     NaN
2       2906b810c7d4411798c6938adc9daaa5     NaN      NaN     NaN
3       fafdcd668e3743c1bb461111dcafc2a4     NaN      NaN     NaN
4       4d5c57ea9a6940dd891ad53e9dbe8da0     NaN      NaN     NaN
...                                  ...     ...      ...     ...
306529                               NaN    1.59      NaN     NaN
306530                               NaN    9.53      NaN     NaN
306531                               NaN    3.61      NaN     NaN
306532                               NaN    3.53      NaN     NaN
306533                               NaN    4.05      NaN     NaN

[306534 rows x 4 columns]

In [33]:
events_trial = pd.concat([events_trial.drop(columns='value'),value_expanded], axis = 1)
events_trial.head()

,customer_id,event,time,offer id,amount,offer_id,reward
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9,NaN,NaN,NaN
1,a03223e636434f42ac4c3df47e8bac43,offer received,0,0b1e1539f2cc45b7b9fa7c272da2e1d7,NaN,NaN,NaN
2,e2127556f4f64592b11af22de27a7932,offer received,0,2906b810c7d4411798c6938adc9daaa5,NaN,NaN,NaN
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,0,fafdcd668e3743c1bb461111dcafc2a4,NaN,NaN,NaN
4,68617ca6246f4fbc85e91a2a49552598,offer received,0,4d5c57ea9a6940dd891ad53e9dbe8da0,NaN,NaN,NaN